app/controllers/api/v1/users_controller.rb

SELECT 1 AS one FROM "users" WHERE "users"."email" = 'riorio@mailbox.org' LIMIT 1
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ('riorio@mailbox.org', '$2a$12$wCV/VZ2YMVq99igQPy3Y6.jE/1sHHjhFi4ov5LLHhQsGnUggLYXbW', '2024-12-26 02:48:27.365924', '2024-12-26 02:48:27.365924') RETURNING "id"
---
            def create
            user = User.new(user_params)

            if User.exists?(email: user_params[:email])
                render json: { error: 'Email is already taken' }, status: :unprocessable_entity
            elsif user.save